emacs-config.org
#+TITLE: Echosa's Emacs Configuration
#+OPTIONS: toc:4 h:4
* Introduction
  Inspired by [[http://sachachua.com/blog/2012/06/literate-programming-emacs-configuration-file/][Sacha Chua]], I have moved my Emacs configuration into an
  organized and descriptive [[http://orgmode.org][org-mode]] file. What you are reading now
  is, in fact, my Emacs configuration file.

  Well, sort of.

  With org-mode, I can export the information to a number of
  formats. That means you could be reading this directly from the .org
  file itself, from a markdown file (like the [[https://github.com/echosa/emacs.d/blob/master/README.md][README]] on my Emacs
  configuration GitHub repo), or from an HTML file somewhere on the
  web.

  How this works is based around a part of org-mode called
  org-babel. org-babel allows org-mode to execute code that is
  embedded into a .org file. If you look at the [[https://github.com/echosa/emacs.d/blob/master/dotemacs.el][actual .emacs file]]
  that my Emacs loads, you'll see that all it does is load the .org
  file containing my configuration (the one you're reading now) and
  parse it through org-babel to execute only the blocks of elisp that
  make up the actual configuration, while ignoring the extra
  documetation and narrative, like this introdution section.

  If you're wondering about performance, org-babel doesn't do this
  parse every time I open Emacs. Instead, it sees that I'm trying to
  load `emacs-config.org` and checks for the existence of
  `emacs-config.el`. If it doesn't find that file, or finds an out of
  date version, only then does it parse the .org file to create a new
  .el file. This means there's a bit of a slow startup the first time
  after the org-mode file is changes, but after that there's no
  noticable change in performance (at least on my machine).
  
  Anyway, what follows is my actual Emacs configuration, embedded into
  a descriptive narrative.

* Packages
  External and third-party packages are great. They make adding new things to
  Emacs much nicer and less complicated.
** Cask
  Cask is a dependency manager for Emacs, similar to npm for Node.

  [[http://cask.github.io][Cask website]]
#+begin_src emacs-lisp
(require 'cask "~/.cask/cask.el")
(cask-initialize)
#+end_src
** Pallet
  Pallet keeps your Cask file up-to-date when you install packages through
  Emacs's package manager.

  [[https://github.com/rdallasgray/pallet][Pallet website]]
#+begin_src emacs-lisp
(require 'pallet)
(pallet-mode t)
#+end_src
** Package.el
   Also, we need to set up the package repositories for Emacs' own package
   manager.
#+begin_src emacs-lisp
(setq package-archives
      '(("gnu" . "http://elpa.gnu.org/packages/")
        ("marmalade" . "http://marmalade-repo.org/packages/")
        ("melpa" . "https://melpa.org/packages/")
        ("melpa-stable" . "https://stable.melpa.org/packages/")))
#+end_src
* General Setup
#+begin_src
(temp-buffer-resize-mode 0)
(add-hook 'before-save-hook 'time-stamp)
(setq fill-column 80)
(setq scroll-conservatively 101)
(setq case-fold-search t)
(setq case-replace t)
(setq display-buffer-reuse-frames t)
(setq display-time-24hr-format nil)
(setq display-time-day-and-date t)
(setq large-file-warning-threshold nil)
(setq truncate-partial-width-windows nil)
#+end_src
  Allow `a` to be used in dired to reuse the buffer instead of creating new buffers for every
  directory.
#+begin_src emacs-lisp
(put 'dired-find-alternate-file 'disabled nil)
#+end_src
  Don't load outdated complied files.
#+begin_src emacs-lisp
(setq load-prefer-newer t)
#+end_src
* Uniquify
  If I have two buffers open with two files that have the same name, (e.g. two 
  different README files from two different projects), Emacs will, by default, 
  name the buffers `README` and `README<1>`. This is useless. Therefore, I turn on 
  uniquify and use it to name buffers wtih the same file name based on their 
  parent directories: `README<projdir1>` and `README<projectdir2>`.
#+begin_src emacs-lisp
(require 'uniquify)
(setq uniquify-buffer-name-style 'post-forward-angle-brackets)
#+end_src
* Ido
  Ido makes minibuffer completions much nicer, easier, and faster.
#+begin_src emacs-lisp
(require 'ido)
(ido-mode)
(setq ido-completion-buffer "*Ido Completions*")
(setq ido-completion-buffer-all-completions t)
(setq ido-enable-flex-matching t)
(setq ido-everywhere t)
(icomplete-mode 99)
(ido-vertical-mode 1)
(flx-ido-mode 1)
#+end_src
