emacs-config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Echosa's Emacs Configuration</title>
<!-- 2015-08-25 Tue 09:58 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Brian Zwahr" />
</head>
<body>
<div id="content">
<h1 class="title">Echosa's Emacs Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Packages</a>
<ul>
<li><a href="#sec-2-1">2.1. Cask</a></li>
<li><a href="#sec-2-2">2.2. Package.el</a></li>
</ul>
</li>
<li><a href="#sec-3">3. General Setup</a></li>
<li><a href="#sec-4">4. Uniquify</a></li>
<li><a href="#sec-5">5. Ido</a></li>
<li><a href="#sec-6">6. Evil</a></li>
<li><a href="#sec-7">7. Line Numbers</a></li>
<li><a href="#sec-8">8. Winner-mode</a></li>
<li><a href="#sec-9">9. pbcopy</a></li>
<li><a href="#sec-10">10. Minibuffer</a></li>
<li><a href="#sec-11">11. Programming</a>
<ul>
<li><a href="#sec-11-1">11.1. General</a></li>
<li><a href="#sec-11-2">11.2. Git</a></li>
<li><a href="#sec-11-3">11.3. Projectile</a></li>
<li><a href="#sec-11-4">11.4. Paredit</a></li>
<li><a href="#sec-11-5">11.5. Emacs Lisp</a></li>
<li><a href="#sec-11-6">11.6. Clojure</a></li>
<li><a href="#sec-11-7">11.7. Javascript</a></li>
<li><a href="#sec-11-8">11.8. PHP</a></li>
<li><a href="#sec-11-9">11.9. HTML</a></li>
</ul>
</li>
<li><a href="#sec-12">12. Compilation</a></li>
<li><a href="#sec-13">13. IRC</a></li>
<li><a href="#sec-14">14. WWW</a></li>
<li><a href="#sec-15">15. Email</a></li>
<li><a href="#sec-16">16. Terminals</a></li>
<li><a href="#sec-17">17. Man Pages</a></li>
<li><a href="#sec-18">18. Miscellaneous Functions</a></li>
<li><a href="#sec-19">19. Regular Expressions</a></li>
<li><a href="#sec-20">20. Key Bindings</a></li>
<li><a href="#sec-21">21. Theme</a></li>
<li><a href="#sec-22">22. Backup and Auto Save</a></li>
<li><a href="#sec-23">23. Prettyify Emacs</a>
<ul>
<li><a href="#sec-23-1">23.1. Things I don't want to see</a>
<ul>
<li><a href="#sec-23-1-1">23.1.1. Scroll bars</a></li>
<li><a href="#sec-23-1-2">23.1.2. Tool bar</a></li>
<li><a href="#sec-23-1-3">23.1.3. Menu bar</a></li>
<li><a href="#sec-23-1-4">23.1.4. Splash screen</a></li>
</ul>
</li>
<li><a href="#sec-23-2">23.2. Things I do want to see</a>
<ul>
<li><a href="#sec-23-2-1">23.2.1. Highlight current region/selection</a></li>
<li><a href="#sec-23-2-2">23.2.2. Syntax highlighting</a></li>
<li><a href="#sec-23-2-3">23.2.3. Column number</a></li>
<li><a href="#sec-23-2-4">23.2.4. Show matching parenthesis</a></li>
<li><a href="#sec-23-2-5">23.2.5. Blinking cursor</a></li>
<li><a href="#sec-23-2-6">23.2.6. Visual bell</a></li>
<li><a href="#sec-23-2-7">23.2.7. Show empty lines</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-24">24. Local Setup</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Inspired by <a href="http://sachachua.com/blog/2012/06/literate-programming-emacs-configuration-file/">Sacha Chua</a>, I have moved my Emacs configuration into an
organized and descriptive <a href="http://orgmode.org">org-mode</a> file. What you are reading now
is, in fact, my Emacs configuration file.
</p>

<p>
Well, sort of.
</p>

<p>
With org-mode, I can export the information to a number of
formats. That means you could be reading this directly from the .org
file itself, from a markdown file (like the <a href="https://github.com/echosa/emacs.d/blob/master/README.md">README</a> on my Emacs
configuration GitHub repo), or from an HTML file somewhere on the
web.
</p>

<p>
How this works is based around a part of org-mode called
org-babel. org-babel allows org-mode to execute code that is
embedded into a .org file. If you look at the <a href="https://github.com/echosa/emacs.d/blob/master/dotemacs.el">actual .emacs file</a>
that my Emacs loads, you'll see that all it does is load the .org
file containing my configuration (the one you're reading now) and
parse it through org-babel to execute only the blocks of elisp that
make up the actual configuration, while ignoring the extra
documetation and narrative, like this introdution section.
</p>

<p>
If you're wondering about performance, org-babel doesn't do this
parse every time I open Emacs. Instead, it sees that I'm trying to
load `emacs-config.org` and checks for the existence of
`emacs-config.el`. If it doesn't find that file, or finds an out of
date version, only then does it parse the .org file to create a new
.el file. This means there's a bit of a slow startup the first time
after the org-mode file is changes, but after that there's no
noticable change in performance (at least on my machine).
</p>

<p>
Anyway, what follows is my actual Emacs configuration, embedded into
a descriptive narrative.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Packages</h2>
<div class="outline-text-2" id="text-2">
<p>
External and third-party packages are great. They make adding new things to
Emacs much nicer and less complicated.
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Cask</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Cask is a dependency manager for Emacs, similar to npm for Node.
</p>

<p>
<a href="http://cask.github.io">Cask website</a>
</p>

<p>
First, we require and initialize Cask.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'cask "~/.cask/cask.el")
(cask-initialize)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Package.el</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Also, we need to set up the package repositories for Emacs' own package
manager.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq package-archives
      '(("gnu" . "http://elpa.gnu.org/packages/")
	("marmalade" . "http://marmalade-repo.org/packages/")
	("melpa" . "http://melpa.org/packages/")))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> General Setup</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
(temp-buffer-resize-mode 0)
(add-hook 'before-save-hook 'time-stamp)
(setq fill-column 80)
(setq scroll-conservatively 101)
(setq case-fold-search t)
(setq case-replace t)
(setq display-buffer-reuse-frames t)
(setq display-time-24hr-format nil)
(setq display-time-day-and-date t)
(setq large-file-warning-threshold nil)
(setq truncate-partial-width-windows nil)
</pre>
<p>
Allow `a` to be used in dired to reuse the buffer instead of creating new buffers for every
directory.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(put 'dired-find-alternate-file 'disabled nil)
</pre>
</div>
<p>
Don't load outdated complied files.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq load-prefer-newer t)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Uniquify</h2>
<div class="outline-text-2" id="text-4">
<p>
If I have two buffers open with two files that have the same name, (e.g. two 
different README files from two different projects), Emacs will, by default, 
name the buffers `README` and `README&lt;1&gt;`. This is useless. Therefore, I turn on 
uniquify and use it to name buffers wtih the same file name based on their 
parent directories: `README&lt;projdir1&gt;` and `README&lt;projectdir2&gt;`.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'uniquify)
(setq uniquify-buffer-name-style 'post-forward-angle-brackets)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Ido</h2>
<div class="outline-text-2" id="text-5">
<p>
Ido makes minibuffer completions much nicer, easier, and faster.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'ido)
(ido-mode)
(setq ido-completion-buffer "*Ido Completions*")
(setq ido-completion-buffer-all-completions t)
(setq ido-enable-flex-matching t)
(setq ido-everywhere t)
(icomplete-mode 99)
(ido-vertical-mode 1)
(flx-ido-mode 1)
</pre>
</div>
</div>
</div>
