emacs-config.org
* Evil
  Call me heathen if you wish, but I prefer Vim navigation keys.

  [[https://gitorious.org/evil/pages/Home][Evil website]]
#+begin_src emacs-lisp
(evil-mode 1)
(setq evil-default-cursor '(t))
#+end_src
  Using `key-chord-mode`, I have the vim equivalent of `imap jk <Esc>`, which 
  allows me to to `jk` instead of `Esc` to get out of insert mode.
#+begin_src emacs-lisp
(key-chord-mode 1)
(key-chord-define evil-insert-state-map "jk" 'evil-normal-state)
(key-chord-define evil-motion-state-map "jk" 'evil-normal-state)
(key-chord-define evil-visual-state-map "jk" 'evil-normal-state)
(key-chord-define evil-emacs-state-map "jk" 'evil-normal-state)
#+end_src
  I want Ido buffer switching and file finding when using Vim's `:b` and `:e`.
#+begin_src emacs-lisp
(define-key evil-ex-map "b " 'ido-switch-buffer)
(define-key evil-ex-map "e " 'ido-find-file)
#+end_src
  I also want Vim's `vs` command for surrounding text with quotes, braces, etc.
#+begin_src emacs-lisp
(require 'surround)
(global-surround-mode 1)
#+end_src
  To make things even easier, I set up a "leader key" of `Space`, so that I can
  type `Space <letter>` to run a command. For instance, `Space x` instead of
  `M-x` to execute commands.
#+begin_src emacs-lisp
(require 'evil-leader)
(evil-leader/set-leader "<SPC>")
(evil-leader/set-key "x" 'execute-extended-command)
(evil-leader/set-key ":" 'eval-expression)
(evil-leader/set-key "k" 'ido-kill-buffer)
(evil-leader/set-key "p" 'projectile-commander)
(evil-leader/set-key "d" 'dired)
(evil-leader/set-key "e" 'er/expand-region)
(evil-leader/set-key "m" 'mc/mark-more-like-this-extended)
(evil-leader/set-key "s" 'string-inflection-toggle)
(global-evil-leader-mode)
#+end_src
  Finally, there are some modes that I want to always be in Emacs mode instead
  of Evil.
#+begin_src emacs-lisp
(setq evil-emacs-state-modes
      '(archive-mode bbdb-mode bookmark-bmenu-mode bookmark-edit-annotation-mode browse-kill-ring-mode bzr-annotate-mode calc-mode cfw:calendar-mode completion-list-mode Custom-mode debugger-mode delicious-search-mode desktop-menu-blist-mode desktop-menu-mode doc-view-mode dvc-bookmarks-mode dvc-diff-mode dvc-info-buffer-mode dvc-log-buffer-mode dvc-revlist-mode dvc-revlog-mode dvc-status-mode dvc-tips-mode ediff-mode ediff-meta-mode efs-mode Electric-buffer-menu-mode emms-browser-mode emms-mark-mode emms-metaplaylist-mode emms-playlist-mode etags-select-mode fj-mode gc-issues-mode gdb-breakpoints-mode gdb-disassembly-mode gdb-frames-mode gdb-locals-mode gdb-memory-mode gdb-registers-mode gdb-threads-mode geben-mode gist-list-mode git-rebase-mode gnus-article-mode gnus-browse-mode gnus-group-mode gnus-server-mode gnus-summary-mode google-maps-static-mode ibuffer-mode jde-javadoc-checker-report-mode magit-popup-mode magit-popup-sequence-mode magit-commit-mode magit-revision-mode magit-diff-mode magit-key-mode magit-log-mode magit-mode magit-reflog-mode magit-show-branches-mode magit-branch-manager-mode magit-stash-mode magit-status-mode magit-wazzup-mode magit-refs-mode mh-folder-mode monky-mode mu4e-main-mode mu4e-headers-mode mu4e-view-mode notmuch-hello-mode notmuch-search-mode notmuch-show-mode occur-mode org-agenda-mode package-menu-mode proced-mode rcirc-mode rebase-mode recentf-dialog-mode reftex-select-bib-mode reftex-select-label-mode reftex-toc-mode sldb-mode slime-inspector-mode slime-thread-control-mode slime-xref-mode sr-buttons-mode sr-mode sr-tree-mode sr-virtual-mode tar-mode tetris-mode tla-annotate-mode tla-archive-list-mode tla-bconfig-mode tla-bookmarks-mode tla-branch-list-mode tla-browse-mode tla-category-list-mode tla-changelog-mode tla-follow-symlinks-mode tla-inventory-file-mode tla-inventory-mode tla-lint-mode tla-logs-mode tla-revision-list-mode tla-revlog-mode tla-tree-lint-mode tla-version-list-mode twittering-mode urlview-mode vc-annotate-mode vc-dir-mode vc-git-log-view-mode vc-svn-log-view-mode vm-mode vm-summary-mode w3m-mode wab-compilation-mode xgit-annotate-mode xgit-changelog-mode xgit-diff-mode xgit-revlog-mode xhg-annotate-mode xhg-log-mode xhg-mode xhg-mq-mode xhg-mq-sub-mode xhg-status-extra-mode cider-repl-mode emacsagist-mode elfeed-show-mode elfeed-search-mode notmuch-tree term-mode))
#+end_src
* Line Numbers
  I like line numbers. They help quite a bit with moving around. Here
  I turn on linum-mode globally.
#+begin_src emacs-lisp
(global-linum-mode)
#+end_src
  Then I change the way line numbers are
  displayed to be right-justified.
#+begin_src emacs-lisp
(setq linum-format (lambda
                     (line)
                     (propertize
                      (format (concat "%"
                                      (number-to-string
                                       (length
                                        (number-to-string
                                         (line-number-at-pos
                                          (point-max)))))
                                      "d ")
                              line)
                      'face
                      'linum)))
#+end_src
* Winner-mode
  Winner-mode makes it really easy to handle window changes in
  Emacs. =C-c left-arrow= goes back to the previous window
  configuration (undo), and =C-c right-arrow= goes forward
  (redo). This is especially helpful for when a popop window ruins
  your layout. Simply =C-c left-arrow= to get back to where you were.
#+begin_src emacs-lisp
(winner-mode 1)
#+end_src

* pbcopy
  Clipboard sharing. Copy in Emacs, paste in OS X, and vice versa.

  [[https://github.com/jkp/pbcopy.el][pbcopy source]]
#+begin_src emacs-lisp
(require 'pbcopy)
(turn-on-pbcopy)
#+end_src

