emacs-config.html
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Evil</h2>
<div class="outline-text-2" id="text-6">
<p>
Call me heathen if you wish, but I prefer Vim navigation keys.
</p>

<p>
<a href="https://gitorious.org/evil/pages/Home">Evil website</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(evil-mode 1)
(setq evil-default-cursor '(t))
</pre>
</div>
<p>
Using `key-chord-mode`, I have the vim equivalent of `imap jk &lt;Esc&gt;`, which 
allows me to to `jk` instead of `Esc` to get out of insert mode.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(key-chord-mode 1)
(key-chord-define evil-insert-state-map "jk" 'evil-normal-state)
(key-chord-define evil-motion-state-map "jk" 'evil-normal-state)
(key-chord-define evil-visual-state-map "jk" 'evil-normal-state)
(key-chord-define evil-emacs-state-map "jk" 'evil-normal-state)
</pre>
</div>
<p>
I want Ido buffer switching and file finding when using Vim's `:b` and `:e`.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(define-key evil-ex-map "b " 'ido-switch-buffer)
(define-key evil-ex-map "e " 'ido-find-file)
</pre>
</div>
<p>
I also want Vim's `vs` command for surrounding text with quotes, braces, etc.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'surround)
(global-surround-mode 1)
</pre>
</div>
<p>
To make things even easier, I set up a "leader key" of `Space`, so that I can
type `Space &lt;letter&gt;` to run a command. For instance, `Space x` instead of
`M-x` to execute commands.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'evil-leader)
(evil-leader/set-leader "&lt;SPC&gt;")
(evil-leader/set-key "x" 'execute-extended-command)
(evil-leader/set-key ":" 'eval-expression)
(evil-leader/set-key "k" 'ido-kill-buffer)
(evil-leader/set-key "p" 'projectile-commander)
(evil-leader/set-key "d" 'dired)
(evil-leader/set-key "e" 'er/expand-region)
(evil-leader/set-key "m" 'mc/mark-more-like-this-extended)
(evil-leader/set-key "s" 'string-inflection-toggle)
(global-evil-leader-mode)
</pre>
</div>
<p>
Finally, there are some modes that I want to always be in Emacs mode instead
of Evil.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq evil-emacs-state-modes
      '(archive-mode bbdb-mode bookmark-bmenu-mode bookmark-edit-annotation-mode browse-kill-ring-mode bzr-annotate-mode calc-mode cfw:calendar-mode completion-list-mode Custom-mode debugger-mode delicious-search-mode desktop-menu-blist-mode desktop-menu-mode doc-view-mode dvc-bookmarks-mode dvc-diff-mode dvc-info-buffer-mode dvc-log-buffer-mode dvc-revlist-mode dvc-revlog-mode dvc-status-mode dvc-tips-mode ediff-mode ediff-meta-mode efs-mode Electric-buffer-menu-mode emms-browser-mode emms-mark-mode emms-metaplaylist-mode emms-playlist-mode etags-select-mode fj-mode gc-issues-mode gdb-breakpoints-mode gdb-disassembly-mode gdb-frames-mode gdb-locals-mode gdb-memory-mode gdb-registers-mode gdb-threads-mode geben-mode gist-list-mode gnus-article-mode gnus-browse-mode gnus-group-mode gnus-server-mode gnus-summary-mode google-maps-static-mode ibuffer-mode jde-javadoc-checker-report-mode magit-popup-mode magit-commit-mode magit-diff-mode magit-key-mode magit-log-mode magit-mode magit-reflog-mode magit-show-branches-mode magit-branch-manager-mode magit-stash-mode magit-status-mode magit-wazzup-mode magit-refs-mode mh-folder-mode monky-mode mu4e-main-mode mu4e-headers-mode mu4e-view-mode notmuch-hello-mode notmuch-search-mode notmuch-show-mode occur-mode org-agenda-mode package-menu-mode proced-mode rcirc-mode rebase-mode recentf-dialog-mode reftex-select-bib-mode reftex-select-label-mode reftex-toc-mode sldb-mode slime-inspector-mode slime-thread-control-mode slime-xref-mode sr-buttons-mode sr-mode sr-tree-mode sr-virtual-mode tar-mode tetris-mode tla-annotate-mode tla-archive-list-mode tla-bconfig-mode tla-bookmarks-mode tla-branch-list-mode tla-browse-mode tla-category-list-mode tla-changelog-mode tla-follow-symlinks-mode tla-inventory-file-mode tla-inventory-mode tla-lint-mode tla-logs-mode tla-revision-list-mode tla-revlog-mode tla-tree-lint-mode tla-version-list-mode twittering-mode urlview-mode vc-annotate-mode vc-dir-mode vc-git-log-view-mode vc-svn-log-view-mode vm-mode vm-summary-mode w3m-mode wab-compilation-mode xgit-annotate-mode xgit-changelog-mode xgit-diff-mode xgit-revlog-mode xhg-annotate-mode xhg-log-mode xhg-mode xhg-mq-mode xhg-mq-sub-mode xhg-status-extra-mode cider-repl-mode emacsagist-mode elfeed-show-mode elfeed-search-mode notmuch-tree term-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Line Numbers</h2>
<div class="outline-text-2" id="text-7">
<p>
I like line numbers. They help quite a bit with moving around. Here
I turn on linum-mode globally.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-linum-mode)
</pre>
</div>
<p>
Then I change the way line numbers are
displayed to be right-justified.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq linum-format (lambda
		     (line)
		     (propertize
		      (format (concat "%"
				      (number-to-string
				       (length
					(number-to-string
					 (line-number-at-pos
					  (point-max)))))
				      "d ")
			      line)
		      'face
		      'linum)))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Winner-mode</h2>
<div class="outline-text-2" id="text-8">
<p>
Winner-mode makes it really easy to handle window changes in
Emacs. <code>C-c left-arrow</code> goes back to the previous window
configuration (undo), and <code>C-c right-arrow</code> goes forward
(redo). This is especially helpful for when a popop window ruins
your layout. Simply <code>C-c left-arrow</code> to get back to where you were.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(winner-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> pbcopy</h2>
<div class="outline-text-2" id="text-9">
<p>
Clipboard sharing. Copy in Emacs, paste in OS X, and vice versa.
</p>

<p>
<a href="https://github.com/jkp/pbcopy.el">pbcopy source</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'pbcopy)
(turn-on-pbcopy)
</pre>
</div>
</div>
</div>
