emacs-config.org
* Minibuffer
  This little snippet adds eldoc support to the minibuffer. Requires Emacs 24.4.
  [[http://endlessparentheses.com/sweet-new-features-in-24-4.html][Found on EndlessParenthesis.com.]]
#+begin_src emacs-lisp
(add-hook 'eval-expression-minibuffer-setup-hook #'eldoc-mode)
#+end_src

* Programming
** General
   Indent with 4 spaces, not a tabstop.
#+begin_src emacs-lisp
(setq c-basic-offset 4)
(setq tab-width 4)
(setq indent-tabs-mode nil)
#+end_src
** Git
   Magit is awesome.
#+begin_src emacs-lisp
(require 'magit)
(setq magit-server-window-for-commit 'pop-to-buffer)
(setq magit-use-overlays nil)
#+end_src
** Projectile
  Projectile is, quite simply and objectively, the shit. There's no other way to
  put it.

  [[https://github.com/bbatsov/projectile][Projectile on Github]]
#+begin_src emacs-lisp
(projectile-global-mode)
#+end_src
** Paredit
  If you write any form of Lisp and don't use paredit, change that. 

  [[http://mumble.net/~campbell/emacs/paredit.el][Paredit website]]

  [[http://emacsrocks.com/e14.html][Emacs Rocks episode on paredit]]
#+begin_src emacs-lisp
(require 'paredit)
(add-hook 'emacs-lisp-mode-hook 'paredit-mode)
(add-hook 'clojure-mode-hook 'paredit-mode)
#+end_src
** Emacs Lisp
#+begin_src emacs-lisp
(defun my-emacs-lisp-mode-hook ()
  (eldoc-mode)
  (linum-mode))
(add-hook 'emacs-lisp-mode-hook 'my-emacs-lisp-mode-hook)
#+end_src
** Clojure
#+begin_src emacs-lisp
(add-hook 'clojure-mode-hook 'linum-mode)
(defun my-clojure-mode-hook ()
  (clj-refactor-mode 1)
  (yas-minor-mode 1)
  (cljr-add-keybindings-with-prefix "C-c C-m"))
(add-hook 'clojure-mode-hook 'my-clojure-mode-hook)
(require 'ac-cider)
(add-hook 'cider-mode-hook 'ac-flyspell-workaround)
(add-hook 'cider-mode-hook 'ac-cider-setup)
(add-hook 'cider-repl-mode-hook 'ac-cider-setup)
(eval-after-load "auto-complete"
  '(add-to-list 'ac-modes 'cider-mode))
#+end_src
** Javascript
  Prefer js2-mode to javascript-mode.
#+begin_src emacs-lisp
(autoload 'js2-mode "js2-mode" nil t)
(add-to-list 'auto-mode-alist '("\\.js$" . js2-mode))
#+end_src
** PHP
#+begin_src emacs-lisp
(require 'cl)
(defun my-php-mode-hook ()
  (make-local-variable (quote whitespace-style))
  (setf whitespace-style (quote (face lines-tail tab-mark)))
  (whitespace-mode t)
  (linum-mode 1)
  (subword-mode 1)
  (php-enable-symfony2-coding-style))
#+end_src
** HTML
#+begin_src emacs-lisp
(add-to-list 'auto-mode-alist '("\\.html$" . web-mode))
(setq web-mode-autocompletes-flag t)
(autoload 'zencoding-mode "zencoding-mode" nil t)
(add-hook 'web-mode-hook 'zencoding-mode)
(add-hook 'twig-mode-hook 'zencoding-mode)
#+end_src
* Compilation
  `M-x compile` has some issues with ansi color codes. This fixes
  it. Found at [[http://stackoverflow.com/questions/3072648/cucumbers-ansi-colors-messing-up-emacs-compilation-buffer][StackOverflow]]. 
#+begin_src emacs-lisp
(require 'ansi-color)
(defun colorize-compilation-buffer ()
  (toggle-read-only)
  (ansi-color-apply-on-region (point-min) (point-max))
  (toggle-read-only))
(add-hook 'compilation-filter-hook 'colorize-compilation-buffer)
#+end_src

* IRC
#+begin_src emacs-lisp
(setq erc-nick "echosa")
(setq erc-user-full-name "Echosa")
#+end_src

* WWW
#+begin_src emacs-lisp
(setq browse-url-browser-function 'eww-browse-url)
#+end_src

* Email
#+begin_src emacs-lisp
(setq send-mail-function 'smtpmail-send-it)
#+end_src

* Terminals
#+begin_src emacs-lisp
(setq term-scroll-show-maximum-output nil)
(setq term-scroll-to-bottom-on-output t)
#+end_src

* Man Pages
#+begin_src emacs-lisp
(setq woman-use-own-frame nil)
#+end_src

