emacs-config.html

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Minibuffer</h2>
<div class="outline-text-2" id="text-10">
<p>
This little snippet adds eldoc support to the minibuffer. Requires Emacs 24.4.
<a href="http://endlessparentheses.com/sweet-new-features-in-24-4.html">Found on EndlessParenthesis.com.</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'eval-expression-minibuffer-setup-hook #'eldoc-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Programming</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> General</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Indent with 4 spaces, not a tabstop.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq c-basic-offset 4)
(setq tab-width 4)
(setq indent-tabs-mode nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> Git</h3>
<div class="outline-text-3" id="text-11-2">
<p>
Magit is awesome.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'magit)
(setq magit-server-window-for-commit 'pop-to-buffer)
(setq magit-use-overlays nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11-3" class="outline-3">
<h3 id="sec-11-3"><span class="section-number-3">11.3</span> Projectile</h3>
<div class="outline-text-3" id="text-11-3">
<p>
Projectile is, quite simply and objectively, the shit. There's no other way to
put it.
</p>

<p>
<a href="https://github.com/bbatsov/projectile">Projectile on Github</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(projectile-global-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11-4" class="outline-3">
<h3 id="sec-11-4"><span class="section-number-3">11.4</span> Paredit</h3>
<div class="outline-text-3" id="text-11-4">
<p>
If you write any form of Lisp and don't use paredit, change that. 
</p>

<p>
<a href="http://mumble.net/~campbell/emacs/paredit.el">Paredit website</a>
</p>

<p>
<a href="http://emacsrocks.com/e14.html">Emacs Rocks episode on paredit</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'paredit)
(add-hook 'emacs-lisp-mode-hook 'paredit-mode)
(add-hook 'clojure-mode-hook 'paredit-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11-5" class="outline-3">
<h3 id="sec-11-5"><span class="section-number-3">11.5</span> Emacs Lisp</h3>
<div class="outline-text-3" id="text-11-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun my-emacs-lisp-mode-hook ()
  (eldoc-mode)
  (linum-mode))
(add-hook 'emacs-lisp-mode-hook 'my-emacs-lisp-mode-hook)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11-6" class="outline-3">
<h3 id="sec-11-6"><span class="section-number-3">11.6</span> Clojure</h3>
<div class="outline-text-3" id="text-11-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'clojure-mode-hook 'linum-mode)
(require 'ac-cider)
(add-hook 'cider-mode-hook 'ac-flyspell-workaround)
(add-hook 'cider-mode-hook 'ac-cider-setup)
(add-hook 'cider-repl-mode-hook 'ac-cider-setup)
(eval-after-load "auto-complete"
  '(add-to-list 'ac-modes 'cider-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11-7" class="outline-3">
<h3 id="sec-11-7"><span class="section-number-3">11.7</span> Javascript</h3>
<div class="outline-text-3" id="text-11-7">
<p>
Prefer js2-mode to javascript-mode.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(autoload 'js2-mode "js2-mode" nil t)
(add-to-list 'auto-mode-alist '("\\.js$" . js2-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11-8" class="outline-3">
<h3 id="sec-11-8"><span class="section-number-3">11.8</span> PHP</h3>
<div class="outline-text-3" id="text-11-8">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'cl)
(defun my-php-mode-hook ()
  (make-local-variable (quote whitespace-style))
  (setf whitespace-style (quote (face lines-tail tab-mark)))
  (whitespace-mode t)
  (linum-mode 1)
  (subword-mode 1)
  (php-enable-symfony2-coding-style))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11-9" class="outline-3">
<h3 id="sec-11-9"><span class="section-number-3">11.9</span> HTML</h3>
<div class="outline-text-3" id="text-11-9">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'auto-mode-alist '("\\.html$" . web-mode))
(setq web-mode-autocompletes-flag t)
(autoload 'zencoding-mode "zencoding-mode" nil t)
(add-hook 'web-mode-hook 'zencoding-mode)
(add-hook 'twig-mode-hook 'zencoding-mode)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Compilation</h2>
<div class="outline-text-2" id="text-12">
<p>
`M-x compile` has some issues with ansi color codes. This fixes
it. Found at <a href="http://stackoverflow.com/questions/3072648/cucumbers-ansi-colors-messing-up-emacs-compilation-buffer">StackOverflow</a>. 
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'ansi-color)
(defun colorize-compilation-buffer ()
  (toggle-read-only)
  (ansi-color-apply-on-region (point-min) (point-max))
  (toggle-read-only))
(add-hook 'compilation-filter-hook 'colorize-compilation-buffer)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> IRC</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq erc-nick "echosa")
(setq erc-user-full-name "Echosa")
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> WWW</h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq browse-url-browser-function 'eww-browse-url)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> Email</h2>
<div class="outline-text-2" id="text-15">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq send-mail-function 'smtpmail-send-it)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> Terminals</h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq term-scroll-show-maximum-output nil)
(setq term-scroll-to-bottom-on-output t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> Man Pages</h2>
<div class="outline-text-2" id="text-17">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq woman-use-own-frame nil)
</pre>
</div>
</div>
</div>
