emacs-config.el

(add-hook 'eval-expression-minibuffer-setup-hook #'eldoc-mode)

(setq c-basic-offset 4)
(setq tab-width 4)
(setq indent-tabs-mode nil)

(setq magit-server-window-for-commit 'pop-to-buffer)
(setq magit-use-overlays nil)

(projectile-global-mode)

(require 'paredit)
(add-hook 'emacs-lisp-mode-hook 'paredit-mode)
(add-hook 'clojure-mode-hook 'paredit-mode)

(defun my-emacs-lisp-mode-hook ()
  (eldoc-mode)
  (linum-mode))
(add-hook 'emacs-lisp-mode-hook 'my-emacs-lisp-mode-hook)

(add-hook 'clojure-mode-hook 'linum-mode)
(require 'ac-cider)
(add-hook 'cider-mode-hook 'ac-flyspell-workaround)
(add-hook 'cider-mode-hook 'ac-cider-setup)
(add-hook 'cider-repl-mode-hook 'ac-cider-setup)
(eval-after-load "auto-complete"
  '(add-to-list 'ac-modes 'cider-mode))

(autoload 'js2-mode "js2" nil t)
(add-to-list 'auto-mode-alist '("\\.js$" . js2-mode))

(require 'cl)
(defun my-php-mode-hook ()
  (make-local-variable (quote whitespace-style))
  (setf whitespace-style (quote (face lines-tail tab-mark)))
  (whitespace-mode t)
  (linum-mode 1)
  (subword-mode 1)
  (php-enable-symfony2-coding-style))

(add-to-list 'auto-mode-alist '("\\.phtml$" . web-mode))
(setq web-mode-autocompletes-flag t)

(require 'ansi-color)
(defun colorize-compilation-buffer ()
  (toggle-read-only)
  (ansi-color-apply-on-region (point-min) (point-max))
  (toggle-read-only))
(add-hook 'compilation-filter-hook 'colorize-compilation-buffer)

(setq erc-nick "echosa")
(setq erc-user-full-name "Echosa")

(setq browse-url-browser-function 'eww-browse-url)

(setq send-mail-function 'smtpmail-send-it)

(setq term-scroll-show-maximum-output nil)
(setq term-scroll-to-bottom-on-output t)

(setq woman-use-own-frame nil)
