emacs-config.org
* Miscellaneous Functions
#+begin_src emacs-lisp
;; http://www.emacswiki.org/emacs/ToggleWindowSplit
(defun toggle-window-split ()
  (interactive)
  (if (= (count-windows) 2)
      (let* ((this-win-buffer (window-buffer))
             (next-win-buffer (window-buffer (next-window)))
             (this-win-edges (window-edges (selected-window)))
             (next-win-edges (window-edges (next-window)))
             (this-win-2nd (not (and (<= (car this-win-edges)
                                         (car next-win-edges))
                                     (<= (cadr this-win-edges)
                                         (cadr next-win-edges)))))
             (splitter
              (if (= (car this-win-edges)
                     (car (window-edges (next-window))))
                  'split-window-horizontally
                'split-window-vertically)))
        (delete-other-windows)
        (let ((first-win (selected-window)))
          (funcall splitter)
          (if this-win-2nd (other-window 1))
          (set-window-buffer (selected-window) this-win-buffer)
          (set-window-buffer (next-window) next-win-buffer)
          (select-window first-win)
          (if this-win-2nd (other-window 1))))))
(define-key ctl-x-4-map "t" 'toggle-window-split)
#+end_src
* Regular Expressions
#+begin_src emacs-lisp
(defun reb-query-replace-this-regxp (replace)
  "Uses the regexp built with re-builder to query the target buffer.
This function must be run from within the re-builder buffer, not the target
buffer.

Argument REPLACE String used to replace the matched strings in the buffer.
 Subexpression references can be used (\1, \2, etc)."
  (interactive "sReplace with: ")
  (if (eq major-mode 'reb-mode)
      (let ((reg (reb-read-regexp)))
        (select-window reb-target-window)
        (save-excursion
          (beginning-of-buffer)
          (query-replace-regexp reg replace)))
    (message "Not in a re-builder buffer!")))
(setq reb-mode-hook
      '((lambda nil
          (define-key reb-mode-map "\245" 'reb-query-replace-this-regxp))))
#+end_src

* Key Bindings
#+begin_src emacs-lisp
(global-set-key "\M-n" 'scroll-up-line)
(global-set-key "\M-p" 'scroll-down-line)
(global-set-key "\C-x9" 'delete-other-windows-vertically)
(global-set-key "\M-@" 'er/expand-region)
(global-set-key "\C-cm" 'mc/mark-more-like-this-extended)
#+end_src
* Theme
  Solarized Dark is where it's at.
#+begin_src emacs-lisp
(when window-system (load-theme 'solarized-dark t))
#+end_src
  Trust all themes.
#+begin_src emacs-lisp
(setq custom-safe-themes t)
#+end_src
* Backup and Auto Save
#+begin_src emacs-lisp
(setq auto-save-file-name-transforms '((".*" "~/.emacs.tmp/" nil)))
(setq auto-save-list-file-prefix "~/.emacs.tmp/.saves-")
(setq backup-directory-alist '(("" . "~/.emacs.tmp")))
#+end_src
* Prettyify Emacs
** Things I don't want to see
*** Scroll bars
#+begin_src emacs-lisp
(when (fboundp 'toggle-scroll-bar) (toggle-scroll-bar nil))
#+end_src
*** Tool bar
#+begin_src emacs-lisp
(tool-bar-mode -1)
#+end_src
*** Menu bar
#+begin_src emacs-lisp
(menu-bar-mode -1)
#+end_src
*** Splash screen
    It's unnecessary, really.
#+begin_src emacs-lisp
(setq inhibit-startup-screen t)
#+end_src
** Things I do want to see
*** Highlight current region/selection
#+begin_src emacs-lisp
(transient-mark-mode t)
#+end_src
*** Syntax highlighting
#+begin_src emacs-lisp
(global-font-lock-mode t)
#+end_src
*** Column number
#+begin_src emacs-lisp
(column-number-mode t)
#+end_src
*** Show matching parenthesis
#+begin_src emacs-lisp
(show-paren-mode t)
#+end_src
*** Blinking cursor
#+begin_src emacs-lisp
(setq blink-cursor-mode t)
#+end_src
*** Visual bell 
    This blinks the screen when ever an error would normally make a sound.
#+begin_src emacs-lisp
(setq visible-bell t)
#+end_src
*** Show empty lines
#+begin_src emacs-lisp
(setq indicate-empty-lines t)
#+end_src

