emacs-config.html

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> Miscellaneous Functions</h2>
<div class="outline-text-2" id="text-18">
<div class="org-src-container">

<pre class="src src-emacs-lisp">;; http://www.emacswiki.org/emacs/ToggleWindowSplit
(defun toggle-window-split ()
  (interactive)
  (if (= (count-windows) 2)
      (let* ((this-win-buffer (window-buffer))
	     (next-win-buffer (window-buffer (next-window)))
	     (this-win-edges (window-edges (selected-window)))
	     (next-win-edges (window-edges (next-window)))
	     (this-win-2nd (not (and (&lt;= (car this-win-edges)
					 (car next-win-edges))
				     (&lt;= (cadr this-win-edges)
					 (cadr next-win-edges)))))
	     (splitter
	      (if (= (car this-win-edges)
		     (car (window-edges (next-window))))
		  'split-window-horizontally
		'split-window-vertically)))
	(delete-other-windows)
	(let ((first-win (selected-window)))
	  (funcall splitter)
	  (if this-win-2nd (other-window 1))
	  (set-window-buffer (selected-window) this-win-buffer)
	  (set-window-buffer (next-window) next-win-buffer)
	  (select-window first-win)
	  (if this-win-2nd (other-window 1))))))
(define-key ctl-x-4-map "t" 'toggle-window-split)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> Regular Expressions</h2>
<div class="outline-text-2" id="text-19">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun reb-query-replace-this-regxp (replace)
  "Uses the regexp built with re-builder to query the target buffer.
This function must be run from within the re-builder buffer, not the target
buffer.

Argument REPLACE String used to replace the matched strings in the buffer.
 Subexpression references can be used (\1, \2, etc)."
  (interactive "sReplace with: ")
  (if (eq major-mode 'reb-mode)
      (let ((reg (reb-read-regexp)))
	(select-window reb-target-window)
	(save-excursion
	  (beginning-of-buffer)
	  (query-replace-regexp reg replace)))
    (message "Not in a re-builder buffer!")))
(setq reb-mode-hook
      '((lambda nil
	  (define-key reb-mode-map "\245" 'reb-query-replace-this-regxp))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> Key Bindings</h2>
<div class="outline-text-2" id="text-20">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key "\M-n" 'scroll-up-line)
(global-set-key "\M-p" 'scroll-down-line)
(global-set-key "\C-x9" 'delete-other-windows-vertically)
(global-set-key "\M-@" 'er/expand-region)
(global-set-key "\C-cm" 'mc/mark-more-like-this-extended)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> Theme</h2>
<div class="outline-text-2" id="text-21">
<p>
Solarized Dark is where it's at.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">;;(when window-system (load-theme 'solarized-dark t))
</pre>
</div>
<p>
Trust all themes.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">;;(setq custom-safe-themes t)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> Backup and Auto Save</h2>
<div class="outline-text-2" id="text-22">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq auto-save-file-name-transforms '((".*" "~/.emacs.tmp/" nil)))
(setq auto-save-list-file-prefix "~/.emacs.tmp/.saves-")
(setq backup-directory-alist '(("" . "~/.emacs.tmp")))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> Prettyify Emacs</h2>
<div class="outline-text-2" id="text-23">
</div><div id="outline-container-sec-23-1" class="outline-3">
<h3 id="sec-23-1"><span class="section-number-3">23.1</span> Things I don't want to see</h3>
<div class="outline-text-3" id="text-23-1">
</div><div id="outline-container-sec-23-1-1" class="outline-4">
<h4 id="sec-23-1-1"><span class="section-number-4">23.1.1</span> Scroll bars</h4>
<div class="outline-text-4" id="text-23-1-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(when (fboundp 'toggle-scroll-bar) (toggle-scroll-bar nil))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-23-1-2" class="outline-4">
<h4 id="sec-23-1-2"><span class="section-number-4">23.1.2</span> Tool bar</h4>
<div class="outline-text-4" id="text-23-1-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(tool-bar-mode -1)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-23-1-3" class="outline-4">
<h4 id="sec-23-1-3"><span class="section-number-4">23.1.3</span> Menu bar</h4>
<div class="outline-text-4" id="text-23-1-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(menu-bar-mode -1)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-23-1-4" class="outline-4">
<h4 id="sec-23-1-4"><span class="section-number-4">23.1.4</span> Splash screen</h4>
<div class="outline-text-4" id="text-23-1-4">
<p>
It's unnecessary, really.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq inhibit-startup-screen t)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-23-2" class="outline-3">
<h3 id="sec-23-2"><span class="section-number-3">23.2</span> Things I do want to see</h3>
<div class="outline-text-3" id="text-23-2">
</div><div id="outline-container-sec-23-2-1" class="outline-4">
<h4 id="sec-23-2-1"><span class="section-number-4">23.2.1</span> Highlight current region/selection</h4>
<div class="outline-text-4" id="text-23-2-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(transient-mark-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-23-2-2" class="outline-4">
<h4 id="sec-23-2-2"><span class="section-number-4">23.2.2</span> Syntax highlighting</h4>
<div class="outline-text-4" id="text-23-2-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-font-lock-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-23-2-3" class="outline-4">
<h4 id="sec-23-2-3"><span class="section-number-4">23.2.3</span> Column number</h4>
<div class="outline-text-4" id="text-23-2-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(column-number-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-23-2-4" class="outline-4">
<h4 id="sec-23-2-4"><span class="section-number-4">23.2.4</span> Show matching parenthesis</h4>
<div class="outline-text-4" id="text-23-2-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(show-paren-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-23-2-5" class="outline-4">
<h4 id="sec-23-2-5"><span class="section-number-4">23.2.5</span> Blinking cursor</h4>
<div class="outline-text-4" id="text-23-2-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq blink-cursor-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-23-2-6" class="outline-4">
<h4 id="sec-23-2-6"><span class="section-number-4">23.2.6</span> Visual bell</h4>
<div class="outline-text-4" id="text-23-2-6">
<p>
This blinks the screen when ever an error would normally make a sound.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq visible-bell t)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-23-2-7" class="outline-4">
<h4 id="sec-23-2-7"><span class="section-number-4">23.2.7</span> Show empty lines</h4>
<div class="outline-text-4" id="text-23-2-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq indicate-empty-lines t)
</pre>
</div>
</div>
</div>
</div>
</div>
