emacs-config.el

(pcase system-name
  ("Saffron.local" (progn
                     (setq exec-path
                           '("/usr/local/bin" "/usr/bin" "/bin" "/usr/sbin" "/sbin"))
                     (setenv "PATH" (mapconcat 'concat
                                               (append '("/usr/local/pear/bin"
                                                         "/usr/local/bin"
                                                         "/Users/echosa/.cask/bin")
                                                       (list (getenv "PATH")))
                                               ":"))
                     (set-face-attribute 'default nil :family "Consolas" :height 120)
                     (when (window-system)
                       (ns-set-resource nil "ApplePressAndHoldEnabled" "NO")))))
